test/cassettes/distribute_tax.yml

---
http_interactions:
- request:
    method: post
    uri: "{VERTEX_SOAP_API}"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId>{VERTEX_TRUSTED_ID}</TrustedId></Login><DistributeTaxRequest
        transactionType="SALE" documentNumber="test123" documentDate="2018-11-15"><LineItem
        lineItemNumber="1" taxDate="2018-11-15"><Customer><Destination><StreetAddress1>11
        Wall Street</StreetAddress1><City>New York</City><MainDivision>NY</MainDivision><PostalCode>10005</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product>t-shirts</Product><Quantity>7</Quantity><InputTotalTax>5.00</InputTotalTax></LineItem><LineItem
        lineItemNumber="2" taxDate="2018-11-14"><Customer><Destination><StreetAddress1>1600
        Pennsylvania Ave NW</StreetAddress1><City>Washington</City><MainDivision>DC</MainDivision><PostalCode>20500</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product>t-shirts</Product><Quantity>4</Quantity><InputTotalTax>5.00</InputTotalTax></LineItem></DistributeTaxRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1264'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 500
      message: ''
    headers:
      Date:
      - Tue, 27 Nov 2018 21:47:23 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '759'
      Connection:
      - keep-alive
      Soapaction:
      - '""'
      Server:
      - ''
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Header></soapenv:Header><soapenv:Body><soapenv:Fault><faultcode>soapenv:Client</faultcode><faultstring
        xml:lang=\"en\">Input tax has been specified but there are no taxes to which
        it may be distributed. Please verify the details for this transaction.</faultstring><detail><ns2:VertexException
        xmlns:ns2=\"urn:vertexinc:oseries:exception:1:0\"><exceptionType>VertexDataValidationException</exceptionType><rootCause>Input
        tax has been specified but there are no taxes to which it may be distributed.
        Please verify the details for this transaction.\r\n</rootCause></ns2:VertexException></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>"
    http_version: 
  recorded_at: Tue, 27 Nov 2018 21:47:23 GMT
recorded_with: VCR 4.0.0
